<a href="https://colab.research.google.com/github/yadavrahyl2k15/titanic_kaggle/blob/main/titanic4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
data_train=pd.read_csv("/content/train.csv")
data_train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [3]:
data_train.shape

(891, 12)

In [4]:
data_train.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [5]:
data_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
data_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
data_train["Embarked"].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [8]:
data_train["Age"]=data_train["Age"].fillna(28.0)
data_train["Embarked"]=data_train["Embarked"].fillna("S")
data_train["Fare"]=data_train["Fare"].astype(int)

In [9]:
data_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [10]:
data_train.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   31.785634
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.703730
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.000000
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.000000
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.000000

[8 rows x 7 columns]

In [11]:
from sklearn import preprocessing
le_gender=preprocessing.LabelEncoder()

In [12]:
le_gender.fit(data_train["Sex"])

LabelEncoder()

In [13]:
data_train["Sex_encoded"]=le_gender.transform(data_train["Sex"])

In [14]:
le_embarked=preprocessing.LabelEncoder()

In [15]:
le_embarked.fit(data_train["Embarked"])

LabelEncoder()

In [16]:
data_train["Embarked_encoded"]=le_embarked.transform(data_train["Embarked"])

In [17]:
data_train.head()

   PassengerId  Survived  Pclass  ... Embarked Sex_encoded  Embarked_encoded
0            1         0       3  ...        S           1                 2
1            2         1       1  ...        C           0                 0
2            3         1       3  ...        S           0                 2
3            4         1       1  ...        S           0                 2
4            5         0       3  ...        S           1                 2

[5 rows x 14 columns]

In [18]:
x=pd.DataFrame(data_train.loc[:,["Pclass","SibSp","Parch","Age","Sex_encoded","Embarked_encoded"]])
y=data_train["Survived"]

In [19]:
from sklearn.ensemble import RandomForestClassifier

In [20]:
rf=RandomForestClassifier(criterion='gini', 
                             n_estimators=500,
                             min_samples_split=10,
                             min_samples_leaf=1,
                             max_features='auto',
                             max_depth = 5,
                             oob_score=True,
                             random_state=1,
                             n_jobs=-1)

In [21]:
rf.fit(x,y)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=5, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=10,
                       min_weight_fraction_leaf=0.0, n_estimators=500,
                       n_jobs=-1, oob_score=True, random_state=1, verbose=0,
                       warm_start=False)

In [22]:
rf.score(x,y)

0.8395061728395061

In [23]:
data_test=pd.read_csv("/content/test.csv",index_col=0)
data_test.head()

             Pclass  ... Embarked
PassengerId          ...
892               3  ...        Q
893               3  ...        S
894               2  ...        Q
895               3  ...        S
896               3  ...        S

[5 rows x 10 columns]

In [24]:
data_test.isnull().sum()

Pclass        0
Name          0
Sex           0
Age          86
SibSp         0
Parch         0
Ticket        0
Fare          1
Cabin       327
Embarked      0
dtype: int64

In [25]:
data_test["Age"]=data_test["Age"].fillna(28.0)
data_test["Fare"]=data_test["Fare"].fillna(31).astype(int)
data_test=data_test.drop("Cabin",axis=1)

In [26]:
data_test.isna().sum()

Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
dtype: int64

In [27]:
data_test["sex_encoded"]=le_gender.transform(data_test["Sex"])
data_test["Embarked_encoded"]=le_embarked.transform(data_test["Embarked"])

In [28]:
data_test.head()

             Pclass  ... Embarked_encoded
PassengerId          ...
892               3  ...                1
893               3  ...                2
894               2  ...                1
895               3  ...                2
896               3  ...                2

[5 rows x 11 columns]

In [29]:
x_test=pd.DataFrame(data_test.loc[:,["Pclass","SibSp","Parch","Age","sex_encoded","Embarked_encoded"]])
x_test.head()

             Pclass  SibSp  Parch   Age  sex_encoded  Embarked_encoded
PassengerId
892               3      0      0  34.5            1                 1
893               3      1      0  47.0            0                 2
894               2      0      0  62.0            1                 1
895               3      0      0  27.0            1                 2
896               3      1      1  22.0            0                 2

In [30]:
test_pred=rf.predict(x_test)
test_pred

array([0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1,
       1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1,
       0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0])

In [31]:
submission_df=pd.DataFrame(test_pred,index=data_test.index,columns=["Survived"])
submission_df

             Survived
PassengerId
892                 0
893                 0
894                 0
895                 0
896                 0
...               ...
1305                0
1306                1
1307                0
1308                0
1309                0

[418 rows x 1 columns]

In [32]:
submission_df.to_csv("/content/submission4.csv")